tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"

brew "ack"
brew "autoconf"
brew "bat"
brew "binutils"
brew "coreutils"
brew "curl"
brew "diffutils"
brew "dnsmasq"
brew "envchain"
brew "findutils"
brew "gawk"
brew "gettext"
brew "git-extras"
brew "git"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gnutls"
brew "gpatch"
brew "grep"
brew "gzip"
brew "htop"
brew "jq"
brew "less"
brew "make"
brew "midnight-commander"
brew "openssl"
brew "pwgen"
brew "screen"
brew "tmux"
brew "tree"
brew "vim"
brew "watch"
brew "wdiff"
brew "wget"

cask "iterm2"
cask "keepassxc"
cask "karabiner-elements"
cask "brave-browser"

mas "1Password 7", id: 1333542190
mas "iStat Menus", id: 1319778037

