brew "envchain"
brew "git"
brew "git-extras"

brew "coreutils"
brew "findutils"
brew "gnu-tar"
brew "gnu-sed"
brew "gawk"
brew "gnutls"
brew "gnu-indent"
brew "gnu-getopt"
brew "grep"
brew "binutils"
brew "diffutils"
brew "gnu-which"
brew "gzip"
brew "screen"
brew "watch"
brew "wdiff"
brew "wget"
brew "ess"
brew "make"
brew "gpatch"
brew "curl"
brew "autoconf"
brew "dnsmasq"
brew "openssl"
brew "gettext"

brew "nodejs"
brew "yarn"

cask "keepassxc"

cask "brave-browser"
