tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "aws/tap"
tap "xen0l/homebrew-taps"
tap "heroku/brew"

# Fundamentals

brew "pipx"

# Drivers

brew "libffi"
cask "wacom-tablet"

# General Packages

brew "ack"
brew "autoconf"
brew "bat"
brew "binutils"
brew "coreutils"
brew "curl"
brew "diffutils"
brew "dnsmasq"
brew "envchain"
brew "findutils"
brew "gawk"
brew "gettext"
brew "git-extras"
brew "git"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gnutls"
brew "gpatch"
brew "grep"
brew "gzip"
brew "htop"
brew "imagemagick"
brew "iproute2mac"
brew "jq"
brew "less"
brew "make"
brew "midnight-commander"
brew "openssl"
brew "pwgen"
brew "screen"
brew "tmux"
brew "tree"
brew "vim"
brew "watch"
brew "wdiff"
brew "wget"

# Toolbelt
cask "licecap"


# Applications
cask "iterm2"
cask "karabiner-elements"
cask "brave-browser"
cask "visual-studio-code"
cask "sublime-text"
cask "telegram"
cask "signal"
cask "skype"
cask "keybase"
cask "discord"
cask "obsidian"
cask "grammarly"
cask "grammarly-desktop"
cask "microsoft-teams"
cask "vlc"
cask "kindle"
cask "spotify"
cask "duet"
cask "surfshark"
cask "bartender"
cask "slack"
cask "google-drive"
cask "microsoft-edge"


# Development

brew "postgresql@14"
cask "docker", overwrite: true, link: true
brew "awscli"
brew "docker-credential-helper-ecr"
brew "heroku/brew/heroku"
brew "watchman"
cask "aws-vault"
cask "anaconda"
brew "nvm"
brew "yarn"
cask "session-manager-plugin"
cask "ngrok"
brew "ykman"
cask "yubico-yubikey-manager"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-virtualenvwrapper"
cask "cmake"
brew "cmake"
brew "go"
brew "gopls"
# # brew "rust"
#brew "rustup-init"
# # brew "rustfmt"
brew "openjdk"
brew "qemu"
cask "dotnet-sdk"

brew "terraform"

# for Rust Gaminng
brew "glfw"
brew "sdl2"
brew "sdl2_image"
brew "sdl2_ttf"
brew "sdl2_mixer"
brew "sdl2_image"


# Programming apps
cask "nosql-workbench"
brew "gh"           # github
brew "git-lfs"      # github large file support


brew "aws-sam-cli"


cask "arduino"
cask "raspberry-pi-imager"
cask "balenaetcher"
cask "kicad"
cask "autodesk-fusion360"               if system "source $HOME/.workstation-setup-config; [ $WORKSTATION = 'personal' ]"
cask "amazon-chime"                     if system "source $HOME/.workstation-setup-config; [ $WORKSTATION = 'maxilux' ]"

#brew "vault"                            if system "source $HOME/.workstation-setup-config; [ $WORKSTATION = 'work' ]"

cask "obs"                              if system "source $HOME/.workstation-setup-config; [ $WORKSTATION = 'personal' ]"
cask "zoom"                             if system "source $HOME/.workstation-setup-config; [ $WORKSTATION = 'personal' ]"
#cask "loupedeck"                        if system "source $HOME/.workstation-setup-config; [ $WORKSTATION = 'personal' ]"
cask "ledger-live"                      if system "source $HOME/.workstation-setup-config; [ $WORKSTATION = 'personal' ]"
cask "keepassxc"
cask "synology-drive"                   if system "source $HOME/.workstation-setup-config; [ $WORKSTATION = 'personal' ]"
cask "adobe-creative-cloud"
cask "ultimaker-cura"                   if system "source $HOME/.workstation-setup-config; [ $WORKSTATION = 'personal' ]"
cask "audacity"                         if system "source $HOME/.workstation-setup-config; [ $WORKSTATION = 'personal' ]"
cask "blender"
cask "inkscape"
cask "anki"                             if system "source $HOME/.workstation-setup-config; [ $WORKSTATION = 'personal' ]"
# cask "ankiapp-anki"                     if system "source $HOME/.workstation-setup-config; [ $WORKSTATION = 'personal' ]"

mas "1Password 7", id: 1333542190
mas "iStat Menus", id: 1319778037
mas "The Unarchiver", id: 425424353
mas "FruitJuice", id: 671736912

# mas "Affinity Photo", id: 824183456
# mas "Affinity Designer", id: 824171161

# mas "Pages", id: 409201541
# mas "Numbers", id: 409203825
mas "Keynote", id: 409183694

mas "Yubikey Authenticator", id: 1497506650

mas "Final Cut Pro", id: 424389933
mas "Motion", id: 434290957
mas "Compressor", id: 424390742

mas "Logic Pro", id: 634148309          if system "source $HOME/.workstation-setup-config; [ $WORKSTATION = 'personal' ]"
mas "GarageBand", id: 682658836         if system "source $HOME/.workstation-setup-config; [ $WORKSTATION = 'personal' ]"

# mas "Xcode", id: 497799835              if system "source $HOME/.workstation-setup-config; [ $WORKSTATION = 'personal' ]"


# Libraries for development
