tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"

brew "ack"
brew "autoconf"
brew "bat"
brew "binutils"
brew "coreutils"
brew "curl"
brew "diffutils"
brew "dnsmasq"
brew "envchain"
brew "findutils"
brew "gawk"
brew "gettext"
brew "git-extras"
brew "git"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gnutls"
brew "gpatch"
brew "grep"
brew "gzip"
brew "htop"
brew "jq"
brew "less"
brew "make"
brew "midnight-commander"
brew "openssl"
brew "pwgen"
brew "screen"
brew "tmux"
brew "tree"
brew "vim"
brew "watch"
brew "wdiff"
brew "wget"

cask "iterm2"
cask "keepassxc"
cask "karabiner-elements"
cask "brave-browser"

mas "1Password 7", id: 1333542190
mas "iStat Menus", id: 1319778037

tap "aws/tap"
tap "xen0l/homebrew-taps"
tap "heroku/brew"

brew "docker", overwrite: true, link: true
brew "awscli"
brew "docker-credential-helper-ecr"
brew "aws-gate"
brew "heroku/brew/heroku"
brew "watchman"
cask "aws-vault"

cask "anaconda"
cask "session-manager-plugin"
cask "visual-studio-code"
cask "sublime-text"
cask "ngrok"

brew "vault" if system "source $HOME/.workstation-setup-config; [ $WORKSTATION = 'work' ]"

brew "ykman"

cask "yubico-yubikey-manager"
cask "telegram"
cask "signal"
cask "keybase"
cask "discord"
cask "obsidian"
cask "grammarly"
cask "grammarly-desktop"
cask "microsoft-teams"
cask "vlc"
# cask "wacom-tablet"

cask "google-drive" if system "source $HOME/.workstation-setup-config; [ $WORKSTATION = 'personal' ]"
cask "zoom"         if system "source $HOME/.workstation-setup-config; [ $WORKSTATION = 'personal' ]"
cask "slack"        if system "source $HOME/.workstation-setup-config; [ $WORKSTATION = 'personal' ]"
cask "loupedeck"    if system "source $HOME/.workstation-setup-config; [ $WORKSTATION = 'personal' ]"
brew "ledger-live"  if system "source $HOME/.workstation-setup-config; [ $WORKSTATION = 'personal' ]"
brew "keepassxc"    if system "source $HOME/.workstation-setup-config; [ $WORKSTATION = 'personal' ]"

